НВ_Доработки/InformationRegisters/СБП_QRКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СБП_QRКоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>status</Name>
					<Comment>CREATED, BLOCKED, NOT_STARTED, ACCEPTED, REJECTED, RECEIVED</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаГенерации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>imageParams_mediaType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>imageParams_content</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>amount</Name>
					<Comment>Сумма операции в копейках</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>payload</Name>
					<Comment>Payload зарегистрированного QR кода в СБП</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>qrcType</Name>
					<Comment>Тип QR кода: 01 - Статический QR-код, 02 - Динамический QR-код (QR на кассе), 03 - QR-код для привязки счета Плательщика (подписки)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоступлениеНаРС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>imageParams_height</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>imageParams_width</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>qrcId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

НВ_Доработки/Documents/ЗаявкаНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаявкаНаДоставку</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НВД_КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтоимостьДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОплачиваетПолучатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоставленоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВодительЗаберетГрузСамостоятельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаявокНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтправленоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УДАЛИТЬ_Основание</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоставленоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжидаемаяДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжидаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставкиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_ТелефонВодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтветственныйЗаДоставку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>авто_Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтправленоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаЗатратНаДоставку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТелефонКонтактногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтправленEMail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидТранспортногоСредства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

НВ_Доработки/CommonModules/НВД_ОбщийМодульСервер/Ext/Module.bsl
#Область Доставка

Функция ПолучитьМассивСсылокНаДоставки(ЗаказКлиента) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("УчитыватьДоставкуТовара") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗаказКлиента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаявкаНаДоставкуОснования.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаДоставку.Основания КАК ЗаявкаНаДоставкуОснования
	|ГДЕ
	|	ЗаявкаНаДоставкуОснования.Основание = &Основание
	|	И НЕ ЗаявкаНаДоставкуОснования.Ссылка.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаявкаНаДоставкуОснования.Ссылка.Дата";
	Запрос.УстановитьПараметр("Основание", ЗаказКлиента);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
КонецФункции

#КонецОбласти

#Область КонтактнаяИнформация

Функция ПолучитьТелефонКонтактногоЛица(КонтактноеЛицо) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КонтактныеЛицаКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	               |ИЗ
	               |	Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
	               |ГДЕ
	               |	КонтактныеЛицаКонтактнаяИнформация.Тип = &Тип
	               |	И КонтактныеЛицаКонтактнаяИнформация.Вид = &Вид
				   |	И КонтактныеЛицаКонтактнаяИнформация.Ссылка = &КонтактноеЛицо";
	
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица);
	Запрос.УстановитьПараметр("КонтактноеЛицо", КонтактноеЛицо);
	
	Результатзапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерТелефона;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТелефонКонтрагента(Контрагент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	               |ИЗ
	               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |ГДЕ
	               |	КонтрагентыКонтактнаяИнформация.Тип = &Тип
	               |	И КонтрагентыКонтактнаяИнформация.Вид = &Вид
				   |	И КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент";
	
	Запрос.УстановитьПараметр("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
	Запрос.УстановитьПараметр("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента"));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Результатзапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерТелефона;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции  

Функция ПолучитьEmailКонтрагента(Контрагент) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КонтрагентыКонтактнаяИнформация.АдресЭП КАК АдресЭП
	               |ИЗ
	               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |ГДЕ
	               |	КонтрагентыКонтактнаяИнформация.Тип = &Тип
	               |	И КонтрагентыКонтактнаяИнформация.Вид = &Вид
				   |	И КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент";
	
	Запрос.УстановитьПараметр("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
	Запрос.УстановитьПараметр("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EmailКонтрагента"));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Результатзапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.АдресЭП;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти 

#Область ПолучениеРеквизитовСправочниковИДокументов

Функция ПолучитьЦветМеткиКонтрагента(Контрагент) Экспорт
	
	Если ЗначениеЗаполнено(Контрагент.Метка) Тогда
		Если ЗначениеЗаполнено(Контрагент.Метка.НастройкаЦвета) Тогда	
			Возврат СериализаторXDTO.XMLЗначение(Тип("Цвет"), Контрагент.Метка.НастройкаЦвета);
		Иначе
			Возврат "";
		КонецЕсли;
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции

#КонецОбласти 

#Область УсловноеОформление

// Функция - Добавить условное оформление
//  https://infostart.ru/1c/articles/1335442/
//
// Параметры:
//  ФормаОбъекта         - ФормаПриложения                 - управляемая форма
//  ПараметрыОформления     - Структура                     - параметры оформления
//  Отборы                 - Массив, Структура             - возможен массив структур
//              * Ключи -
//              ** ТЧ - Строка - имя таблицы
//              ** Поле
//              ** ПолеДляОтбора - Строка - имя поля
//              ** Значение - Произвольный - устанавливаемое значение
//              ** ВидСравнения - ВидСравненияКомпоновкиДанных - необязательное
//  ВидГруппы             - ТипГруппыЭлементовОтбораКомпоновкиДанных     - необязательное, по умолчанию "ГруппаИ"
// 
// Возвращаемое значение:
//  Структура - содержит ключи:
//  - Элемент - количество элементов
//  - Отбор - количество отборов
// 
//ЭлементОформления = СписокЗапасы.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
//	Элемент = ЭлементОформления.Оформление.Элементы.Найти("ЦветФона");
//	Элемент.Значение = WebЦвета.СеребристоСерый;
//	Элемент.Использование = Истина;
//	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ЭлементОтбора.Использование = Истина;
//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура.дор_МинМаксЗаполнено");
//	ЭлементОтбора.ПравоеЗначение = Ложь;
//	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
//	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Наименование");
//	ПолеОформления.Использование = Истина;
Функция ДобавитьУсловноеОформление(ФормаОбъекта, ПараметрыОформления, Отборы, ВидГруппы = Неопределено) экспорт
    
    Если Не ТипЗнч(Отборы) = Тип("Массив") Тогда
        Отборы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Отборы);
    КонецЕсли;
    Отбор = Отборы[0];
    ПолеОформления = СтрЗаменить(Отбор.ТЧ,"Объект.","");
    //Если ТипЗнч(             
	//ФормаОбъекта.Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
    НовыйЭлемент = ФормаОбъекта[Отбор.ТЧ].КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить(); 
    Для Каждого Элемент Из ПараметрыОформления Цикл
        
        Если Элемент.Ключ="Поле" Тогда
            ПолеОформления = Элемент.Значение;
        Иначе
            НовыйЭлемент.Оформление.УстановитьЗначениеПараметра(Элемент.Ключ, Элемент.Значение);
        КонецЕсли;
        
    КонецЦикла;
    НовыйЭлемент.Использование = Истина;
    
    ОформляемыеПоля = НовыйЭлемент.Поля.Элементы.Добавить();
    ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных(ПолеОформления);
    
    Если Отборы.Количество()>1 Тогда
        ГруппаОтбора = НовыйЭлемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
        Если ЗначениеЗаполнено(ВидГруппы) Тогда
            ГруппаОтбора.ТипГруппы = ВидГруппы;
        Иначе
            ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
        КонецЕсли;
        ГруппаОтбора.Использование = Истина;
    Иначе
        ГруппаОтбора = Неопределено;
    КонецЕсли;
    
    Для Каждого Отбор Из Отборы Цикл
        
        Если ГруппаОтбора = Неопределено Тогда
            ЭлементОтбор = НовыйЭлемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        Иначе
            ЭлементОтбор = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        КонецЕсли;
        
        //ЭлементОтбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(Отбор.ТЧ+"."+Отбор.Поле); 
		ЭлементОтбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(Отбор.Поле);
        
        Если Отбор.Свойство("ВидСравнения") Тогда
            ЭлементОтбор.ВидСравнения    = Отбор.ВидСравнения;
        Иначе    
            ЭлементОтбор.ВидСравнения    = ВидСравненияКомпоновкиДанных.Равно;
        КонецЕсли;
        
        ЭлементОтбор.ПравоеЗначение = Отбор.Значение;
    КонецЦикла;
    
    Возврат Новый Структура("Элемент, Отбор", ФормаОбъекта[Отбор.ТЧ].КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Количество()-1, НовыйЭлемент.Отбор.Элементы.Количество()-1);
    
КонецФункции

Процедура УстановитьОформлениеКолонкиКонтрагентДинамическогоСпискаВСоответствииСМеткой(ФормаОбъекта, ИмяДинамическогоСписка) Экспорт
	
	Метка = Справочники.МеткиКонтрагентов.Выбрать();
	Пока Метка.Следующий() Цикл
		
		Если Метка.НастройкаЦвета = "" ИЛИ Метка.ПометкаУдаления ИЛИ Метка.ЭтоГруппа Тогда 
			Продолжить;
		КонецЕсли;
		
		ЦветТекста = СериализаторXDTO.XMLЗначение(Тип("Цвет"), Метка.НастройкаЦвета);
		ОтборУсловногоОформления = Новый Структура("ТЧ, Поле, Значение, ВидСравнения", ИмяДинамическогоСписка, "Контрагент.Метка", Метка.Ссылка, ВидСравненияКомпоновкиДанных.Равно);
		
		ПараметрыОформления = Новый Структура; 
		ПараметрыОформления.Вставить("Поле", "Контрагент");
		ПараметрыОформления.Вставить("ЦветТекста", ЦветТекста); 
		
		ДобавитьУсловноеОформление(ФормаОбъекта, ПараметрыОформления, ОтборУсловногоОформления);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СБП

// Проверяет, может ли текущий пользователь создать ссылку СБП на указанную сумму по заказу.
//
// Ограничение задаётся константой "Максимальная сумма в ссылке СБП" и действует на заказ в целом:
// из лимита вычитается сумма ранее созданных по заказу ссылок, кроме отклонённых банком.
// Пользователю с правом "Разрешено создавать ссылки СБП сверх максимальной суммы" ограничение
// не выставляется. Незаполненная константа означает, что ограничение не задано.
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказПокупателя - заказ, по которому создаётся ссылка.
//  Сумма - Число - сумма создаваемой ссылки.
//
// Возвращаемое значение:
//  Структура:
//   * Разрешено   - Булево - можно ли создать ссылку на указанную сумму;
//   * ТекстОтказа - Строка - причина отказа, заполнена при Разрешено = Ложь;
//   * Лимит       - Число  - максимальная сумма из константы, 0 если ограничение не задано;
//   * СуммаСсылок - Число  - сумма действующих ссылок по заказу;
//   * Доступно    - Число  - сумма, на которую по заказу ещё можно создать ссылку.
//
Функция ПроверитьЛимитСуммыСсылкиСБП(Заказ, Сумма) Экспорт
	
	Результат = Новый Структура("Разрешено, ТекстОтказа, Лимит, СуммаСсылок, Доступно", Истина, "", 0, 0, 0);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбщийМодульСервер.НастройкаПользователя("РазрешеноПревышатьМаксимальнуюСуммуСсылкиСБП") = Истина Тогда
		Возврат Результат;
	КонецЕсли;
	
	Лимит = Константы.НВД_МаксимальнаяСуммаВСсылкеСБП.Получить();
	
	Если НЕ ЗначениеЗаполнено(Лимит) Тогда //ограничение не настроено
		Возврат Результат;
	КонецЕсли;
	
	Результат.Лимит = Лимит;
	Результат.СуммаСсылок = СуммаДействующихСсылокСБППоЗаказу(Заказ);
	
	Доступно = Лимит - Результат.СуммаСсылок;
	Если Доступно < 0 Тогда
		Доступно = 0;
	КонецЕсли;
	Результат.Доступно = Доступно;
	
	Если Сумма <= Доступно Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.Разрешено = Ложь;
	
	Если Результат.СуммаСсылок = 0 Тогда
		Результат.ТекстОтказа = "Максимальная сумма в ссылке СБП - " + ФорматСуммыСсылкиСБП(Лимит) + " руб.
			|Создать ссылку на большую сумму можно только с правом ""Разрешено создавать ссылки СБП сверх максимальной суммы"".";
	Иначе
		Результат.ТекстОтказа = "По заказу уже созданы ссылки СБП на сумму " + ФорматСуммыСсылкиСБП(Результат.СуммаСсылок) + " руб.
			|при максимальной сумме " + ФорматСуммыСсылкиСБП(Лимит) + " руб.
			|Доступно к созданию: " + ФорматСуммыСсылкиСБП(Доступно) + " руб.";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Сумма ссылок СБП, созданных по заказу и не отклонённых банком, - ожидающих оплаты и оплаченных.
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказПокупателя - заказ, по которому отбираются ссылки.
//
// Возвращаемое значение:
//  Число - сумма действующих ссылок.
//
Функция СуммаДействующихСсылокСБППоЗаказу(Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СБП_QRКоды.status КАК status,
	|	СБП_QRКоды.amount КАК amount
	|ИЗ
	|	РегистрСведений.СБП_QRКоды КАК СБП_QRКоды
	|ГДЕ
	|	СБП_QRКоды.Заказ = &Заказ";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	СуммаСсылок = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если СсылкаСБПОтклонена(Выборка.status) Тогда
			Продолжить;
		КонецЕсли;
		СуммаСсылок = СуммаСсылок + Выборка.amount;
	КонецЦикла;
	
	Возврат СуммаСсылок;
	
КонецФункции

// Признак того, что ссылка СБП оплачена не будет: отклонена, отозвана, просрочена или отменена.
//
// Статусы приходят от банка строками и записываются в регистр как есть, поэтому у разных банков
// различаются регистром и разделителями ("NOT_STARTED" у ГПБ, "NotStarted" у Точки). Сравнение
// нормализованное, всё, что не является явным отказом, считается ожидающим оплаты.
//
// Параметры:
//  Статус - Строка - статус ссылки из регистра сведений СБП_QRКоды.
//
// Возвращаемое значение:
//  Булево - Истина, если ссылка отклонена.
//
Функция СсылкаСБПОтклонена(Статус)
	
	НормализованныйСтатус = ВРег(СтрЗаменить(СокрЛП(Статус), "_", ""));
	
	Возврат СтрНайти(НормализованныйСтатус, "REJECT") > 0
		ИЛИ СтрНайти(НормализованныйСтатус, "REVOK") > 0
		ИЛИ СтрНайти(НормализованныйСтатус, "EXPIR") > 0
		ИЛИ СтрНайти(НормализованныйСтатус, "CANCEL") > 0;
	
КонецФункции

// Сумма для вывода в сообщении пользователю.
//
// Параметры:
//  Сумма - Число - форматируемая сумма.
//
// Возвращаемое значение:
//  Строка - сумма без незначащих нулей.
//
Функция ФорматСуммыСсылкиСБП(Сумма)
	
	Возврат Формат(Сумма, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧН=0");
	
КонецФункции

#КонецОбласти
